[
  {
    "Course ID": "COMP 213",
    "Course Name": "Computing for Engineering Technology",
    "Course Average Weighted Grade": "",
    "Credit Hours": "3",
    "Course Description": "This applied computer course provides students with critical electronic communications, data and file management skills, along with a strong focus on using common productivity applications to format, calculate, analyze, visualize, and present or report data and information. Industry standard project management principles are implemented throughout the course from a digital perspective, so students can have an appreciation for how computing skills relate to real world business processes.",
    "Professor/Teacher Name": "Rasleen Sidhu",
    "Professor/Teacher Email": "rasleen.sidhu@sait.ca"
  },
  {
    "Course ID": "MECH 205",
    "Course Name": "Electro-Mechanical Systems",
    "Course Average Weighted Grade": "",
    "Credit Hours": "3",
    "Course Description": "Electro-mechanical Systems is an introductory course to the world of automation for manufacturing. The course includes theory and lab activities involving pneumatic, electrical, electro-pneumatic, robotics, and computer control applications. The course design is for the beginner who is new to the various control systems and will benefit all Mechanical Engineering Technologists in the workplace as many companies adopt automation for sustainable growth of evolving and competitive manufacturing industries. Cross-referenced to the National Technology Benchmarks (NTB).",
    "Professor/Teacher Name": "Richard Arndt",
    "Professor/Teacher Email": "richard.arndt@sait.ca"
  },
  {
    "Course ID": "STCS 255",
    "Course Name": "Engineering Statics",
    "Course Average Weighted Grade": "",
    "Credit Hours": "1.5",
    "Course Description": "This course covers components and resultants of vectors, two-force members, free-body diagrams, equations of equilibrium, equilibrium of concurrent force systems and pulley systems, moments and couples, equilibrium of non concurrent force systems, truss analysis using method of joints and method of sections, and frame analysis using method of members.",
    "Professor/Teacher Name": "Borzumehr Toloui",
    "Professor/Teacher Email": "borzumehr.toloui@sait.ca"
  },
  {
    "Course ID": "THRM 200",
    "Course Name": "Introduction to Thermodynamics",
    "Course Average Weighted Grade": "",
    "Credit Hours": "1.5",
    "Course Description": "The study of energy in its many forms involves thermodynamic principles. Basic concepts of work, heat, flow and non-flow systems, and equations of state, perfect gases and properties of pure substances. The first law of thermodynamics is applied to practical systems like compressors, turbines, nozzles and other practical system to implement the concept of energy conversion. Basic power cycles will be analyzed and the performance merit to be determined. The various modes of heat transfer will be practiced and applied to simple situations. Cross-referenced to the National Technology Benchmarks (NTB).",
    "Professor/Teacher Name": "Christopher Taggart",
    "Professor/Teacher Email": "christopher.taggart@sait.ca"
  },
  {
    "Course ID": "MATH 238",
    "Course Name": "Mathematics for Engineering & Technology I",
    "Course Average Weighted Grade": "",
    "Credit Hours": "3",
    "Course Description": "This course enables the student to apply the basic knowledge of algebra and introductory calculus to resolve applied scientific and technological problems. Applications include linear motion, areas under curves, and volumes of revolution.",
    "Professor/Teacher Name": "Oluwafemi Alli",
    "Professor/Teacher Email": "femi.alli@sait.ca"
  },
  {
    "Course ID": "MECH 200",
    "Course Name": "Mechanical Engineering Technology Concepts",
    "Course Average Weighted Grade": "",
    "Credit Hours": "3",
    "Course Description": "This design course introduces the basic building blocks required for the common core and the three specializations. Using wide-ranging, flexible design reasoning the learner will learn how to set up problems based on a good understanding of the underlying principles, choose a plan to solve them, and present the results. Cross-referenced to the National Technology Benchmarks (NTB).",
    "Professor/Teacher Name": "Shaw Kinjo",
    "Professor/Teacher Email": "shaw.kinjo@sait.ca"
  },
  {
    "Course ID": "MET320",
    "Course Name": "Thermodynamics II",
    "Course Average Weighted Grade": "N/A",
    "Credit Hours": "3",
    "Course Description": "An advanced course focusing on applications of thermodynamic principles to power cycles, refrigeration, and gas mixtures.",
    "Professor/Teacher Name": "Dr. Sarah Thompson",
    "Professor/Teacher Email": "sarah.thompson@sait.ca"
  }
]